--[[
	太阳神三国杀游戏工具扩展包·战功荣耀
	适用版本：V2 - 愚人版（版本号：20150401）清明补丁（版本号：20150405）
	通用战功：79/79
	武将战功：174/174
	3v3战功：8/8
	1v1战功：9/9
	虎牢关战功：1/1
	隐藏战功：4/4
	其他功能：3/5
	战功总数：275/275
]]--
module("extensions.glory", package.seeall)
extension = sgs.Package("glory", sgs.Package_GeneralPack)
--技能暗将
AnJiang = sgs.General(extension, "gloryAnJiang", "god", 5, true, true, true)
--翻译信息
sgs.LoadTranslationTable{
	["glory"] = "战功荣耀",
	["@glory"] = "请选择统计战功的角色",
	["#glory_confirm"] = "<b><font color=\"cyan\">系统消息</font>：本局游戏将对 %from 统计战功，请各位朋友予以配合！谢谢。</b>",
	["#glory_achieved"] = "<b><font color=\"cyan\">系统消息</font>：恭喜 %from 完成战功 %arg ！</b>"
}
--[[
	时机：确定伤害点数时
]]--
gloryConfirmDamage = sgs.CreateTriggerSkill{
	name = "#gloryConfirmDamage",
	global = true,
	frequency = sgs.Skill_Compulsory,
	events = {sgs.ConfirmDamage},
	on_trigger = function(self, event, player, data)
		local damage = data:toDamage()
		local source = damage.from
		if source and source:objectName() == player:objectName() then
			local room = player:getRoom()
			if room:getTag("GlorySystemClosed"):toBool() then
				return false
			end
			local thread = room:getThread()
			room:setTag("gloryData", data)
			thread:trigger(sgs.NonTrigger, room, source, sgs.QVariant("gloryConfirmDamage"))
			room:removeTag("gloryData")
		end
		return false
	end,
	can_trigger = function(self, target)
		return target ~= nil
	end,
	priority = 9,
}
--添加时机
AnJiang:addSkill(gloryConfirmDamage)
--[[
	时机：即将受到伤害时
]]--
gloryDamageInflicted = sgs.CreateTriggerSkill{
	name = "#gloryDamageInflicted",
	global = true,
	frequency = sgs.Skill_Compulsory,
	events = {sgs.DamageInflicted},
	on_trigger = function(self, event, player, data)
		local damage = data:toDamage()
		local victim = damage.to
		if victim and victim:objectName() == player:objectName() then
			local room = player:getRoom()
			if room:getTag("GlorySystemClosed"):toBool() then
				return false
			end
			local thread = room:getThread()
			room:setTag("gloryData", data)
			local source = damage.from
			if source then
				thread:trigger(sgs.NonTrigger, room, source, sgs.QVariant("gloryDamageInflicted_Source"))
			end
			thread:trigger(sgs.NonTrigger, room, victim, sgs.QVariant("gloryDamageInflicted"))
			room:removeTag("gloryData")
		end
		return false
	end,
	can_trigger = function(self, target)
		return target
	end,
	priority = 9,
}
--添加时机
AnJiang:addSkill(gloryDamageInflicted)
--[[
	时机：执行伤害时
	原因：防止遗漏导致游戏结束的伤害事件
]]--
gloryDamageDone = sgs.CreateTriggerSkill{
	name = "#gloryDamageDone",
	global = true,
	frequency = sgs.Skill_Compulsory,
	events = {sgs.DamageDone},
	on_trigger = function(self, event, player, data)
		local damage = data:toDamage()
		local victim = damage.to
		if victim and victim:objectName() == player:objectName() then
			local room = player:getRoom()
			if room:getTag("GlorySystemClosed"):toBool() then
				return false
			end
			local thread = room:getThread()
			room:setTag("gloryData", data)
			local source = damage.from
			if source then
				thread:trigger(sgs.NonTrigger, room, source, sgs.QVariant("gloryDamageDone_Source"))
			end
			thread:trigger(sgs.NonTrigger, room, victim, sgs.QVariant("gloryDamageDone"))
			room:removeTag("gloryData")
		end
		return false
	end,
	can_trigger = function(self, target)
		return target
	end,
	priority = 1,
}
--添加时机
AnJiang:addSkill(gloryDamageDone)
--[[
	时机：胜负判定时
]]--
gloryGameOverJudge = sgs.CreateTriggerSkill{
	name = "#gloryGameOverJudge",
	global = true,
	frequency = sgs.Skill_Compulsory,
	events = {sgs.GameOverJudge},
	on_trigger = function(self, event, player, data)
		local death = data:toDeath()
		local victim = death.who
		if victim and victim:objectName() == player:objectName() then
			local room = player:getRoom()
			if room:getTag("GlorySystemClosed"):toBool() then
				return false
			end
			local thread = room:getThread()
			room:setTag("gloryData", data)
			local reason = death.damage
			if reason then
				local killer = reason.from
				if killer then
					thread:trigger(sgs.NonTrigger, room, killer, sgs.QVariant("gloryGameOverJudge_Killer"))
				end
			end
			thread:trigger(sgs.NonTrigger, room, victim, sgs.QVariant("gloryGameOverJudge"))
			room:removeTag("gloryData")
		end
		return false
	end,
	can_trigger = function(self, target)
		return target
	end,
	priority = 9,
}
--添加时机
AnJiang:addSkill(gloryGameOverJudge)
--[[
	时机：胜负判定后
]]--
gloryAfterGameOverJudge = sgs.CreateTriggerSkill{
	name = "#gloryAfterGameOverJudge",
	global = true,
	frequency = sgs.Skill_Compulsory,
	events = {sgs.GameOverJudge},
	on_trigger = function(self, event, player, data)
		local death = data:toDeath()
		local who = death.who
		if who and who:objectName() == player:objectName() then
			local room = player:getRoom()
			if room:getTag("GlorySystemClosed"):toBool() then
				return false
			end
			local thread = room:getThread()
			thread:trigger(sgs.NonTrigger, room, player, sgs.QVariant("gloryAfterGameOverJudge"))
		end
		return false
	end,
	can_trigger = function(self, target)
		return target and target:isDead()
	end,
	priority = 0.01,
}
--添加时机
AnJiang:addSkill(gloryAfterGameOverJudge)
--[[
	时机：死亡时
]]--
gloryDeath = sgs.CreateTriggerSkill{
	name = "#gloryDeath",
	global = true,
	frequency = sgs.Skill_Compulsory,
	events = {sgs.Death},
	on_trigger = function(self, event, player, data)
		local death = data:toDeath()
		local victim = death.who
		if victim and victim:objectName() == player:objectName() then
			local room = player:getRoom()
			if room:getTag("GlorySystemClosed"):toBool() then
				return false
			end
			local thread = room:getThread()
			room:setTag("gloryData", data)
			local reason = death.damage
			if reason then
				local killer = reason.from
				if killer then
					thread:trigger(sgs.NonTrigger, room, killer, sgs.QVariant("gloryDeath_Killer"))
				end
			end
			thread:trigger(sgs.NonTrigger, room, victim, sgs.QVariant("gloryDeath"))
			room:removeTag("gloryData")
		end
		return false
	end,
	can_trigger = function(self, target)
		return target 
	end,
	priority = 9,
}
--[[****************************************************************
	----------------------------------------------------------------
								通用战功
	----------------------------------------------------------------
]]--****************************************************************
--[[****************************************************************
	战功：安乐公
	描述：在1局游戏中，累计3次被乐不思蜀后判定牌都不是红桃
]]--****************************************************************
sgs.LoadTranslationTable{
	["AnLeGong"] = "安乐公",
}
--[[****************************************************************
	战功：八门金锁
	描述：在1局游戏中，装备八卦阵连续判定红色花色至少5次
]]--****************************************************************
sgs.LoadTranslationTable{
	["BaMenJinSuo"] = "八门金锁",
}
--[[****************************************************************
	战功：百人斩
	描述：累积杀死100人
]]--****************************************************************
sgs.LoadTranslationTable{
	["BaiRenZhan"] = "百人斩",
}
--[[****************************************************************
	战功：败家子
	描述：在一局游戏中，弃牌阶段累计弃掉至少10张桃
]]--****************************************************************
sgs.LoadTranslationTable{
	["BaiJiaZi"] = "败家子",
}
--[[****************************************************************
	战功：搬石砸脚
	描述：与人决斗失败累计10次
]]--****************************************************************
sgs.LoadTranslationTable{
	["BanShiZaJiao"] = "搬石砸脚",
}
--[[****************************************************************
	战功：暴君
	描述：身为主公在1局游戏中，在反贼和内奸全部存活的情况下杀死全部忠臣，并最后胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["BaoJun"] = "暴君",
}
--[[****************************************************************
	战功：被看穿了吗
	描述：一局游戏中，使用火攻失败至少3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["BeiKanChuanLeMa"] = "被看穿了吗",
}
--[[****************************************************************
	战功：兵精粮足
	描述：在1局游戏中，累计3次被兵粮寸断后判定牌都是草花
]]--****************************************************************
sgs.LoadTranslationTable{
	["BingJingLiangZu"] = "兵精粮足",
}
--[[****************************************************************
	战功：兵器库
	描述：在一局游戏中，累计装备过至少10次武器以及10次防具
]]--****************************************************************
sgs.LoadTranslationTable{
	["BingQiKu"] = "兵器库",
}
--[[****************************************************************
	战功：秉公无私
	描述：身为主公在一局游戏中从未对忠臣造成伤害，并取得胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["BingGongWuSi"] = "秉公无私",
}
--[[****************************************************************
	战功：不屈不挠
	描述：一格体力情况下，累计出闪100次
]]--****************************************************************
sgs.LoadTranslationTable{
	["BuQuBuNao"] = "不屈不挠",
}
--[[****************************************************************
	战功：拆迁办
	描述：在一个回合内使用卡牌过河拆桥/顺手牵羊累计4次
]]--****************************************************************
sgs.LoadTranslationTable{
	["ChaiQianBan"] = "拆迁办",
}
--[[****************************************************************
	战功：拆迁大队
	描述：在一局游戏中，累计使用卡牌过河拆桥10次以上
]]--****************************************************************
sgs.LoadTranslationTable{
	["ChaiQianDaDui"] = "拆迁大队",
}
--[[****************************************************************
	战功：常胜将军
	描述：连续胜利10局
]]--****************************************************************
sgs.LoadTranslationTable{
	["ChangShengJiangJun"] = "常胜将军",
}
--[[****************************************************************
	战功：趁虚而入
	描述：身为反贼在1局游戏中，在自己的第1回合时手刃主公
]]--****************************************************************
sgs.LoadTranslationTable{
	["ChenXuErRu"] = "趁虚而入",
}
--[[****************************************************************
	战功：赤胆忠心
	描述：身为忠臣在1局游戏中，手刃至少2个反贼或内奸
]]--****************************************************************
sgs.LoadTranslationTable{
	["ChiDanZhongXin"] = "赤胆忠心",
}
--[[****************************************************************
	战功：打酱油的
	描述：在1局游戏中，在自己的回合开始前就死亡
]]--****************************************************************
sgs.LoadTranslationTable{
	["DaJiangYouDe"] = "打酱油的",
}
--[[****************************************************************
	战功：打铁匠
	描述：累计将铁索连环重铸30次
]]--****************************************************************
sgs.LoadTranslationTable{
	["DaTieJiang"] = "打铁匠",
}
--[[****************************************************************
	战功：大事化小
	描述：一局游戏中发动白银狮子特效减少伤害至少1次
]]--****************************************************************
sgs.LoadTranslationTable{
	["DaShiHuaXiao"] = "大事化小",
}
--[[****************************************************************
	战功：刀枪不入
	描述：一局游戏中发动仁王盾特效3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["DaoQiangBuRu"] = "刀枪不入",
}
--[[****************************************************************
	战功：东宫西略
	描述：在一局游戏中，身份为男性主公，而忠臣为两名女性武将并在女性忠臣全部存活的情况下获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["DongGongXiLve"] = "东宫西略",
}
--[[****************************************************************
	战功：更大的炮灰
	描述：被南蛮入侵或万箭齐发打死累计50次
]]--****************************************************************
sgs.LoadTranslationTable{
	["GengDaDePaoHui"] = "更大的炮灰",
}
--[[****************************************************************
	战功：攻其不备
	描述：一局游戏中，成功使用火攻造成伤害至少3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["GongQiBuBei"] = "攻其不备",
}
--[[****************************************************************
	战功：狗屎运
	描述：当你的开局4牌的颜色全为黑色时,清除你的N盘逃跑记录(N为5-10的随机数)
]]--****************************************************************
sgs.LoadTranslationTable{
	["GouShiYun"] = "狗屎运",
	["#ClearRolesEscapeRate"] = "<b><font color=\"cyan\">系统消息</font>：%from 清除了 %arg 盘身份局逃跑记录（实际清除了 %arg2 盘）</b>",
	["#ClearHegemonyEscapeRate"] = "<b><font color=\"cyan\">系统消息</font>：%from 清除了 %arg 盘国战逃跑记录（实际清除了 %arg2 盘）</b>",
}
--[[****************************************************************
	战功：苟延残喘
	描述：在1局游戏中被救活至少5次
]]--****************************************************************
sgs.LoadTranslationTable{
	["GouYanCanChuan"] = "苟延残喘",
}
--[[****************************************************************
	战功：诡计重重
	描述：在一局游戏中，累计使用锦囊牌至少20次
]]--****************************************************************
sgs.LoadTranslationTable{
	["GuiJiChongChong"] = "诡计重重",
}
--[[****************************************************************
	战功：果农
	描述：游戏开始时，起手手牌全部是“桃”
]]--****************************************************************
sgs.LoadTranslationTable{
	["GuoNong"] = "果农",
}
--[[****************************************************************
	战功：何以解忧
	描述：一局游戏中，使用酒回复体力至少2次
]]--****************************************************************
sgs.LoadTranslationTable{
	["HeYiJieYou"] = "何以解忧",
}
--[[****************************************************************
	战功：横扫千军
	描述：在1局游戏中，手刃7名角色并且获得胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["HengSaoQianJun"] = "横扫千军",
}
--[[****************************************************************
	战功：鸿运当头
	描述：在1个回合内使用至少3次无中生有
]]--****************************************************************
sgs.LoadTranslationTable{
	["HongYunDangTou"] = "鸿运当头",
}
--[[****************************************************************
	战功：饥肠辘辘
	描述：在1局游戏中，累计3次被兵粮寸断后判定牌都不是草花
]]--****************************************************************
sgs.LoadTranslationTable{
	["JiChangLuLu"] = "饥肠辘辘",
}
--[[****************************************************************
	战功：极乐世界
	描述：在1局游戏中，累计3次被乐不思蜀后判定牌都是红心
]]--****************************************************************
sgs.LoadTranslationTable{
	["JiLeShiJie"] = "极乐世界",
}
--[[****************************************************************
	战功：箭无虚发
	描述：使用1次万箭齐发打死至少3名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["JianWuXuFa"] = "箭无虚发",
}
--[[****************************************************************
	战功：竭智尽忠
	描述：身为忠臣在1局游戏中，在自己的首回合中手刃一个反贼或内奸，最后取得胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["JieZhiJinZhong"] = "竭智尽忠",
}
--[[****************************************************************
	战功：酒鬼
	描述：出牌阶段开始时，手牌中至少有3张“酒”
]]--****************************************************************
sgs.LoadTranslationTable{
	["JiuGui"] = "酒鬼",
}
--[[****************************************************************
	战功：举火燎天
	描述：在一局游戏中，造成火焰伤害累计10点以上，不含武将技能
]]--****************************************************************
sgs.LoadTranslationTable{
	["JuHuoLiaoTian"] = "举火燎天",
}
--[[****************************************************************
	战功：绝处逢生
	描述：身为反贼在1局游戏中，在其他反贼全部死亡且忠臣全部存活的情况下获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["JueChuFengSheng"] = "绝处逢生",
}
--[[****************************************************************
	战功：绝对防御
	描述：在一局游戏中，使用八卦阵累计出闪20次
]]--****************************************************************
sgs.LoadTranslationTable{
	["JueDuiFangYu"] = "绝对防御",
}
--[[****************************************************************
	战功：绝对零度
	描述：一局游戏中发动寒冰剑特效至少3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["JueDuiLingDu"] = "绝对零度",
}
--[[****************************************************************
	战功：辣手摧花
	描述：一局游戏中杀死至少2名女性角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["LaShouCuiHua"] = "辣手摧花",
}
--[[****************************************************************
	战功：老奸巨猾
	描述：身为内奸在1局游戏中，在主公杀死过忠臣的情况下取得胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["LaoJianJuHua"] = "老奸巨猾",
}
--[[****************************************************************
	战功：老谋深算
	描述：身为内奸在1局游戏中手刃至少4个反贼或忠臣并且取得胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["LaoMouShenSuan"] = "老谋深算",
}
--[[****************************************************************
	战功：乐不思蜀
	描述：在对你的“乐不思蜀”生效后的回合弃牌阶段弃置超过8张手牌
]]--****************************************************************
sgs.LoadTranslationTable{
	["LeBuSiShu"] = "乐不思蜀",
}
--[[****************************************************************
	战功：乱臣贼子
	描述：身为反贼在1局游戏中，手刃至少2个忠臣或内奸
]]--****************************************************************
sgs.LoadTranslationTable{
	["LuanChenZeiZi"] = "乱臣贼子",
}
--[[****************************************************************
	战功：落井下石
	描述：一局游戏中发动古锭刀特效至少3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["LuoJingXiaShi"] = "落井下石",
}
--[[****************************************************************
	战功：命不该绝
	描述：被闪电劈中但是没有死
]]--****************************************************************
sgs.LoadTranslationTable{
	["MingBuGaiJue"] = "命不该绝",
}
--[[****************************************************************
	战功：炮灰
	描述：被南蛮入侵或万箭齐发打死累计10次
]]--****************************************************************
sgs.LoadTranslationTable{
	["PaoHui"] = "炮灰",
}
--[[****************************************************************
	战功：平反大将
	描述：在1局游戏中手刃4个反贼
]]--****************************************************************
sgs.LoadTranslationTable{
	["PingFanDaJiang"] = "平反大将",
}
--[[****************************************************************
	战功：旗开得胜
	描述：一局游戏中，在自己的首回合结束前获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["QiKaiDeSheng"] = "旗开得胜",
}
--[[****************************************************************
	战功：起死回生
	描述：在一局游戏中，累计受过至少20点伤害且最后存活获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["QiSiHuiSheng"] = "起死回生",
}
--[[****************************************************************
	战功：千人斩
	描述：累积杀1000人
]]--****************************************************************
sgs.LoadTranslationTable{
	["QianRenZhan"] = "千人斩",
}
--[[****************************************************************
	战功：惹火上身
	描述：一局游戏中，装备藤甲的时受到至少3次火焰伤害
]]--****************************************************************
sgs.LoadTranslationTable{
	["ReHuoShangShen"] = "惹火上身",
}
--[[****************************************************************
	战功：杀很大
	描述：一回合中发动诸葛连弩特效至少4次
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShaHenDa"] = "杀很大",
}
--[[****************************************************************
	战功：塞翁失马
	描述：一局游戏中，失去白银狮子回复体力至少2次
]]--****************************************************************
sgs.LoadTranslationTable{
	["SaiWengShiMa"] = "塞翁失马",
}
--[[****************************************************************
	战功：射人先射马
	描述：一局游戏中发动麒麟弓特效至少3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["SheRenXianSheMa"] = "射人先射马",
}
--[[****************************************************************
	战功：神偷再世
	描述：在一局游戏中，累计使用卡牌顺手牵羊10次以上
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShenTouZaiShi"] = "神偷再世",
}
--[[****************************************************************
	战功：势如破竹
	描述：一局游戏中发动贯石斧特效至少3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShiRuPoZhu"] = "势如破竹",
}
--[[****************************************************************
	战功：桃花运
	描述：当你的开局手牌全部为红桃时，体力上限加1
]]--****************************************************************
sgs.LoadTranslationTable{
	["TaoHuaYun"] = "桃花运",
	["#gloryTaoHuaYun"] = "<b><font color=\"fuchsia\">桃花运</font>：%from 增加了 %arg 点体力上限。</b>",
}
--[[****************************************************************
	战功：桃王
	描述：在1局游戏中给自己吃过5个或者更多的桃（华佗的技能“急救”除外）
]]--****************************************************************
sgs.LoadTranslationTable{
	["TaoWang"] = "桃王",
}
--[[****************************************************************
	战功：桃仙
	描述：在1局游戏中，使用桃救人至少5次（华佗的技能“急救”除外）
]]--****************************************************************
sgs.LoadTranslationTable{
	["TaoXian"] = "桃仙",
}
--[[****************************************************************
	战功：藤甲兵
	描述：一局游戏中发动藤甲效果抵挡杀、南蛮入侵或万箭齐发至少3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["TengJiaBing"] = "藤甲兵",
}
--[[****************************************************************
	战功：天道威仪
	描述：身为主公在1局游戏中，在忠臣全部死亡后杀死至少3名角色，取得胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["TianDaoWeiYi"] = "天道威仪",
}
--[[****************************************************************
	战功：天谴
	描述：不被改判定牌的情况下被闪电劈死
]]--****************************************************************
sgs.LoadTranslationTable{
	["TianQian"] = "天谴",
}
--[[****************************************************************
	战功：威震四海
	描述：一次对其他角色造成至少5点伤害
]]--****************************************************************
sgs.LoadTranslationTable{
	["WeiZhenSiHai"] = "威震四海",
}
--[[****************************************************************
	战功：为时未晚
	描述：身为反贼，在一局游戏中杀死了除自己以外所有反贼并获得游戏的胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["WeiShiWeiWan"] = "为时未晚",
}
--[[****************************************************************
	战功：唯有杜康
	描述：一局游戏中，使用酒后成功使用杀造成伤害至少3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["WeiYouDuKang"] = "唯有杜康",
}
--[[****************************************************************
	战功：先拔头筹
	描述：一局游戏中，自己的首回合结束前杀死至少一名非本方武将
]]--****************************************************************
sgs.LoadTranslationTable{
	["XianBaTouChou"] = "先拔头筹",
}
--[[****************************************************************
	战功：邪念惑心
	描述：作为忠臣在一局游戏中，在场上没有反贼时手刃主公
]]--****************************************************************
sgs.LoadTranslationTable{
	["XieNianHuoXin"] = "邪念惑心",
}
--[[****************************************************************
	战功：星驰电走
	描述：在一局游戏中，累计出闪20次
]]--****************************************************************
sgs.LoadTranslationTable{
	["XingChiDianZou"] = "星驰电走",
}
--[[****************************************************************
	战功：悬壶济世
	描述：在一局游戏中，使用桃或技能累计将我方队友脱离濒死状态4次以上
]]--****************************************************************
sgs.LoadTranslationTable{
	["XuanHuJiShi"] = "悬壶济世",
}
--[[****************************************************************
	战功：一骑讨
	描述：与人决斗胜利累计30次
]]--****************************************************************
sgs.LoadTranslationTable{
	["YiJiTao"] = "一骑讨",
}
--[[****************************************************************
	战功：异族之愤
	描述：使用1次南蛮入侵打死至少3名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["YiZuZhiFen"] = "异族之愤",
}
--[[****************************************************************
	战功：有难同当
	描述：1局游戏中，使用铁索连环累计横置其他角色至少6次
]]--****************************************************************
sgs.LoadTranslationTable{
	["YouNanTongDang"] = "有难同当",
}
--[[****************************************************************
	战功：驭马大师
	描述：在一局游戏中，至少更换过8匹马
]]--****************************************************************
sgs.LoadTranslationTable{
	["YuMaDaShi"] = "驭马大师",
}
--[[****************************************************************
	战功：原地起爆
	描述：回合开始阶段你1血0牌的情况下，一回合内杀死3名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["YuanDiQiBao"] = "原地起爆",
}
--[[****************************************************************
	战功：元芳，你怎么看
	描述：元芳，你怎么看？大人，这不科学。
]]--****************************************************************
sgs.LoadTranslationTable{
	["YuanFang_NiZenMeKan"] = "元芳，你怎么看",
}
--[[****************************************************************
	战功：至圣至明
	描述：身为主公在一局游戏中手刃所有反贼和内奸，并在忠臣全部存活的情况下获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["ZhiShengZhiMing"] = "至圣至明",
}
--[[****************************************************************
	战功：忠肝义胆
	描述：身为忠臣在1局游戏中存活，并且主公满体力的情况下取得胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["ZhongGanYiDan"] = "忠肝义胆",
}
--[[****************************************************************
	战功：朱雀星君
	描述：一局游戏中发动朱雀羽扇特效至少3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["ZhuQueXingJun"] = "朱雀星君",
}
--[[****************************************************************
	----------------------------------------------------------------
							武将专属战功
	----------------------------------------------------------------
]]--****************************************************************
--[[****************************************************************
	战功：暗箭难防
	描述：使用旧马岱在一局游戏中发动“潜袭”成功至少6次
]]--****************************************************************
sgs.LoadTranslationTable{
	["AnJianNanFang"] = "暗箭难防",
}
--[[****************************************************************
	战功：霸业可图
	描述：使用陈宫在一局游戏中对吕布发动明策至少2次
]]--****************************************************************
sgs.LoadTranslationTable{
	["BaYeKeTu"] = "霸业可图",
}
--[[****************************************************************
	战功：白马义从
	描述：使用公孙瓒在体力大于2的情况下杀死至少3名角色，并且在体力1的情况下存活并获胜。
]]--****************************************************************
sgs.LoadTranslationTable{
	["BaiMaYiCong"] = "白马义从",
}
--[[****************************************************************
	战功：暴虐之王
	描述：使用董卓在一局游戏中利用技能“暴虐”至少回血10次
]]--****************************************************************
sgs.LoadTranslationTable{
	["BaoNveZhiWang"] = "暴虐之王",
}
--[[****************************************************************
	战功：变拙成巧
	描述：使用张郃在一局游戏中发动巧变移动判定区的牌及装备区的牌各至少3张
]]--****************************************************************
sgs.LoadTranslationTable{
	["BianZhuoChengQiao"] = "变拙成巧",
}
--[[****************************************************************
	战功：不遗余力
	描述：使用郭嘉在1局游戏中发动遗计发牌至少5次
]]--****************************************************************
sgs.LoadTranslationTable{
	["BuYiYuLi"] = "不遗余力",
}
--[[****************************************************************
	战功：才兼文武
	描述：使用姜维在一局游戏中发动挑衅弃掉牌至少4张并发动观星至少2次
]]--****************************************************************
sgs.LoadTranslationTable{
	["CaiJianWenWu"] = "才兼文武",
}
--[[****************************************************************
	战功：拆桃不偿
	描述：使用甘宁在一局游戏中至少拆掉对方5张桃
]]--****************************************************************
sgs.LoadTranslationTable{
	["ChaiTaoBuChang"] = "拆桃不偿",
}
--[[****************************************************************
	战功：长坂虎威
	描述：使用张飞在一回合内使用8张杀
]]--****************************************************************
sgs.LoadTranslationTable{
	["ChangBanHuWei"] = "长坂虎威",
}
--[[****************************************************************
	战功：长坂英雄
	描述：使用赵云在一局游戏中，在刘禅为队友且存活情况下获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["ChangBanYingXiong"] = "长坂英雄",
}
--[[****************************************************************
	战功：刺美人
	描述：使用祝融在1局游戏中对一名男性发动烈刃并拼点赢至少3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["CiMeiRen"] = "刺美人",
}
--[[****************************************************************
	战功：此情常在
	描述：在一局游戏中，布练师发动安恤4次并在阵亡情况下获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["CiQingChangZai"] = "此情常在",
}
--[[****************************************************************
	战功：大幻化师
	描述：使用左慈在一局游戏中获得化身牌至少10张
]]--****************************************************************
sgs.LoadTranslationTable{
	["DaHuanHuaShi"] = "大幻化师",
}
--[[****************************************************************
	战功：大军在此
	描述：使用徐盛在一局游戏中发动破军至少3次并获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["DaJunZaiCi"] = "大军在此",
}
--[[****************************************************************
	战功：大权在握
	描述：使用钟会在一局游戏中有超过8张权
]]--****************************************************************
sgs.LoadTranslationTable{
	["DaQuanZaiWo"] = "大权在握",
}
--[[****************************************************************
	战功：大姨妈
	描述：使用甄姬连续5回合洛神的第一次结果都是红色，不包括改判
]]--****************************************************************
sgs.LoadTranslationTable{
	["DaYiMa"] = "大姨妈",
}
--[[****************************************************************
	战功：大智若愚
	描述：使用刘禅每回合都发动放权并最终获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["DaZhiRuoYu"] = "大智若愚",
}
--[[****************************************************************
	战功：胆小如鼠
	描述：使用旧朱然在一局游戏内连续发动胆守至少7次
]]--****************************************************************
sgs.LoadTranslationTable{
	["DanXiaoRuShu"] = "胆小如鼠",
}
--[[****************************************************************
	战功：荡寇将军
	描述：使用程普在一局游戏中，发动技能“疠火”杀死至少三名反贼最终获得胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["DangKouJiangJun"] = "荡寇将军",
}
--[[****************************************************************
	战功：当阳之吼
	描述：在一局游戏中，使用☆SP张飞累计两次发动大喝与一名角色拼点成功的回合中用红“杀”手刃该角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["DangYangZhiHou"] = "当阳之吼",
}
--[[****************************************************************
	战功：雕虫小技
	描述：使用卧龙在一局游戏中发动“看破”至少15次
]]--****************************************************************
sgs.LoadTranslationTable{
	["DiaoChongXiaoJi"] = "雕虫小技",
}
--[[****************************************************************
	战功：洞察一切
	描述：使用神吕蒙在一局游戏中发动攻心将至少5张无中生有或桃置于牌堆顶
]]--****************************************************************
sgs.LoadTranslationTable{
	["DongChaYiQie"] = "洞察一切",
}
--[[****************************************************************
	战功：毒策士
	描述：使用李儒在一局游戏中，发动绝策杀死至少2名角色并发动焚城杀死至少2名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["DuCeShi"] = "毒策士",
}
--[[****************************************************************
	战功：杜康之子
	描述：使用曹植在一局游戏中发动酒诗后成功用杀造成伤害累计5次
]]--****************************************************************
sgs.LoadTranslationTable{
	["DuKangZhiZi"] = "杜康之子",
}
--[[****************************************************************
	战功：恩怨分明
	描述：使用新法正在一局游戏中分别获得卡牌和受到伤害时发动技能恩怨各2次
]]--****************************************************************
sgs.LoadTranslationTable{
	["EnYuanFenMing"] = "恩怨分明",
}
--[[****************************************************************
	战功：法不容情
	描述：使用满宠在一局游戏中对魏势力角色发动至少4次峻刑
]]--****************************************************************
sgs.LoadTranslationTable{
	["FaBuRongQing"] = "法不容情",
}
--[[****************************************************************
	战功：飞将
	描述：使用吕布在1局游戏中发动方天画戟特效杀死至少2名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["FeiJiang"] = "飞将",
}
--[[****************************************************************
	战功：愤勇难当
	描述：使用☆SP夏侯惇在一局游戏中，至少发动四次愤勇
]]--****************************************************************
sgs.LoadTranslationTable{
	["FenYongNanDang"] = "愤勇难当",
}
--[[****************************************************************
	战功：风驰电掣
	描述：使用夏侯渊在1局游戏中，有连续至少3个回合每个回合都发动2次神速
]]--****************************************************************
sgs.LoadTranslationTable{
	["FengChiDianChe"] = "风驰电掣",
}
--[[****************************************************************
	战功：丰悼王
	描述：使用sp曹昂在一局游戏中发动慷忾摸到装备牌至少3张
]]--****************************************************************
sgs.LoadTranslationTable{
	["FengDaoWang"] = "丰悼王",
}
--[[****************************************************************
	战功：福将
	描述：使用曹洪在一局游戏中发动援护总计回复两点体力
]]--****************************************************************
sgs.LoadTranslationTable{
	["FuJiang"] = "福将",
}
--[[****************************************************************
	战功：辅吴将军
	描述：使用张昭&张纮在一局中发动直谏将至少5张装备牌置于吴势力武将装备区
]]--****************************************************************
sgs.LoadTranslationTable{
	["FuWuJiangJun"] = "辅吴将军",
}
--[[****************************************************************
	战功：刚烈难存
	描述：使用夏侯惇在一局游戏中连续4次刚烈判定均为红桃
]]--****************************************************************
sgs.LoadTranslationTable{
	["GangLieNanCun"] = "刚烈难存",
}
--[[****************************************************************
	战功：顾曲周郎
	描述：使用神周瑜连续至少4回合发动琴音回复体力
]]--****************************************************************
sgs.LoadTranslationTable{
	["GuQuZhouLang"] = "顾曲周郎",
}
--[[****************************************************************
	战功：固若金汤
	描述：使用曹仁在一局游戏中发动至少3次据守，并且在损失体力不多于3点的情况下获胜。
]]--****************************************************************
sgs.LoadTranslationTable{
	["GuRuoJinTang"] = "固若金汤",
}
--[[****************************************************************
	战功：固政为本
	描述：使用张昭张纮在一局游戏中利用技能“固政”获得累计至少40张牌
]]--****************************************************************
sgs.LoadTranslationTable{
	["GuZhengWeiBen"] = "固政为本",
}
--[[****************************************************************
	战功：过目之才
	描述：使用☆SP庞统一回合内累计拿到至少16张牌
]]--****************************************************************
sgs.LoadTranslationTable{
	["GuoMuZhiCai"] = "过目之才",
}
--[[****************************************************************
	战功：红莲业火
	描述：使用神周瑜在一回合发动业炎造成至少5点伤害
]]--****************************************************************
sgs.LoadTranslationTable{
	["HongLianYeHuo"] = "红莲业火",
}
--[[****************************************************************
	战功：红颜祸水
	描述：使用SP貂蝉在一局游戏中，两次对主公和忠臣发动技能“离间”并导致2名忠臣阵亡
]]--****************************************************************
sgs.LoadTranslationTable{
	["HongYanHuoShui"] = "红颜祸水",
}
--[[****************************************************************
	战功：虎子同心
	描述：使用旧关兴张苞在父魂成功后，一个回合杀死至少三名反贼
]]--****************************************************************
sgs.LoadTranslationTable{
	["HuZiTongXin"] = "虎子同心",
}
--[[****************************************************************
	战功：换斗移星
	描述：使用神诸葛在一局游戏中让至少一名狂风状态的角色被火攻杀死
]]--****************************************************************
sgs.LoadTranslationTable{
	["HuanDouYiXing"] = "换斗移星",
}
--[[****************************************************************
	战功：黄天当立
	描述：使用张角在一局游戏中从群雄武将处得到的闪不少于8张
]]--****************************************************************
sgs.LoadTranslationTable{
	["HuangTianDangLi"] = "黄天当立",
}
--[[****************************************************************
	战功：挥泪斩马谡
	描述：使用诸葛亮杀死马谡
]]--****************************************************************
sgs.LoadTranslationTable{
	["HuiLeiZhanMaSu"] = "挥泪斩马谡",
}
--[[****************************************************************
	战功：浑身是胆
	描述：使用赵云在1局游戏中发动龙胆至少杀死3名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["HunShenShiDan"] = "浑身是胆",
}
--[[****************************************************************
	战功：坚守不出
	描述：使用曹仁在一局游戏中连续8回合发动据守
]]--****************************************************************
sgs.LoadTranslationTable{
	["JianShouBuChu"] = "坚守不出",
}
--[[****************************************************************
	战功：见者有份
	描述：使用杨修在一局游戏中发动技能“啖酪”至少6次
]]--****************************************************************
sgs.LoadTranslationTable{
	["JianZheYouFen"] = "见者有份",
}
--[[****************************************************************
	战功：将驰有度
	描述：使用曹彰发动将驰的两种效果各连续两回合
]]--****************************************************************
sgs.LoadTranslationTable{
	["JiangChiYouDu"] = "将驰有度",
}
--[[****************************************************************
	战功：江东之虎
	描述：使用太史慈在1回合内发动天义拼点胜利后，使用【杀】杀死至少3名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["JiangDongZhiHu"] = "江东之虎",
}
--[[****************************************************************
	战功：江东之花
	描述：使用大乔小乔在一局游戏中发动技能星舞造成4点伤害
]]--****************************************************************
sgs.LoadTranslationTable{
	["JiangDongZhiHua"] = "江东之花",
}
--[[****************************************************************
	战功：交际花
	描述：使用孙尚香和全部其他(且至少4个)角色皆使用过结姻
]]--****************************************************************
sgs.LoadTranslationTable{
	["JiaoJiHua"] = "交际花",
}
--[[****************************************************************
	战功：解烦护主
	描述：使用旧韩当在一局游戏游戏中发动“解烦”救过队友孙权至少两次
]]--****************************************************************
sgs.LoadTranslationTable{
	["JieFanHuZhu"] = "解烦护主",
}
--[[****************************************************************
	战功：解语花
	描述：使用步练师在一局游戏中发动安恤摸八张牌以上
]]--****************************************************************
sgs.LoadTranslationTable{
	["JieYuHua"] = "解语花",
}
--[[****************************************************************
	战功：戒酒以备
	描述：使用高顺在一局游戏中使用技能“禁酒”将至少6张酒当成杀使用或打出
]]--****************************************************************
sgs.LoadTranslationTable{
	["JieJiuYiBei"] = "戒酒以备",
}
--[[****************************************************************
	战功：禁军难护
	描述：使用旧韩当在一局游戏中有角色濒死时发动“解烦”并出杀后均被闪避至少5次
]]--****************************************************************
sgs.LoadTranslationTable{
	["JinJunNanHu"] = "禁军难护",
}
--[[****************************************************************
	战功：锦囊袋
	描述：使用黄月英在1个回合内发动至少10次集智
]]--****************************************************************
sgs.LoadTranslationTable{
	["JinNangDai"] = "锦囊袋",
}
--[[****************************************************************
	战功：金枪不倒
	描述：使用周泰在1局游戏中拥有过至少9张不屈牌并且未死
]]--****************************************************************
sgs.LoadTranslationTable{
	["JinQiangBuDao"] = "金枪不倒",
}
--[[****************************************************************
	战功：纠结之心
	描述：使用刘备在1局游戏中至少发动5次雌雄双股剑特效
]]--****************************************************************
sgs.LoadTranslationTable{
	["JiuJieZhiXin"] = "纠结之心",
}
--[[****************************************************************
	战功：绝境逢生
	描述：使用神赵云在一局游戏中,当体力为一滴血的时候，一直保持一体力直到游戏获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["JueJingFengSheng"] = "绝境逢生",
}
--[[****************************************************************
	战功：军威如山
	描述：使用☆SP甘宁在一局游戏中发动军威累计得到过至少6张“闪”
]]--****************************************************************
sgs.LoadTranslationTable{
	["JunWeiRuShan"] = "军威如山",
}
--[[****************************************************************
	战功：坑爹自重
	描述：使用刘禅、孙权&孙策、曹丕&曹植&曹冲坑了自己的老爹
]]--****************************************************************
sgs.LoadTranslationTable{
	["KengDieZiZhong"] = "坑爹自重",
}
--[[****************************************************************
	战功：空城绝唱
	描述：使用诸葛亮在1局游戏中有至少5个回合结束时是空城状态
]]--****************************************************************
sgs.LoadTranslationTable{
	["KongChengJueChang"] = "空城绝唱",
}
--[[****************************************************************
	战功：狂奔的蜗牛
	描述：使用张角在1局游戏发动雷击杀死至少3名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["KuangBenDeWoNiu"] = "狂奔的蜗牛",
}
--[[****************************************************************
	战功：老不死的
	描述：使用孙权在1局游戏中被吴国武将用桃救活至少3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["LaoBuSiDe"] = "老不死的",
}
--[[****************************************************************
	战功：老将的逆袭
	描述：使用黄忠在1局游戏中，剩余1点体力时累计发动烈弓杀死至少3名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["LaoJiangDeNiXi"] = "老将的逆袭",
}
--[[****************************************************************
	战功：雷公助我
	描述：使用张角在一局游戏中在未更改判定牌的情况下至少4次雷击成功
]]--****************************************************************
sgs.LoadTranslationTable{
	["LeiGongZhuWo"] = "雷公助我",
}
--[[****************************************************************
	战功：连绵不绝
	描述：使用陆逊在1个回合内发动至少10次连营
]]--****************************************************************
sgs.LoadTranslationTable{
	["LianMianBuJue"] = "连绵不绝",
}
--[[****************************************************************
	战功：连破克敌
	描述：使用神司马懿在一局游戏中发动3次连破并最后获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["LianPoKeDi"] = "连破克敌",
}
--[[****************************************************************
	战功：怜香惜玉
	描述：使用小乔在一局游戏中发动天香让某名男性武将摸牌至少15张
]]--****************************************************************
sgs.LoadTranslationTable{
	["LianXiangXiYu"] = "怜香惜玉",
}
--[[****************************************************************
	战功：炼狱武神
	描述：使用神关羽在一局游戏中使用红桃花色的杀杀死至少3名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["LianYuWuShen"] = "炼狱武神",
}
--[[****************************************************************
	战功：粮尽援绝
	描述：使用徐晃在1局游戏中用装备区的牌发动断粮至少4次
]]--****************************************************************
sgs.LoadTranslationTable{
	["LiangJinYuanJue"] = "粮尽援绝",
}
--[[****************************************************************
	战功：龙吟九霄
	描述：使用关平在一局游戏中发动龙吟至少4次，并在本局游戏中杀死至少3名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["LongYinJiuXiao"] = "龙吟九霄",
}
--[[****************************************************************
	战功：乱箭肃敌
	描述：使用袁绍在1回合内发动乱击至少6次
]]--****************************************************************
sgs.LoadTranslationTable{
	["LuanJianSuDi"] = "乱箭肃敌",
}
--[[****************************************************************
	战功：乱世的奸雄
	描述：使用曹操在1局游戏中发动奸雄得到至少3张南蛮入侵和1张万箭齐发
]]--****************************************************************
sgs.LoadTranslationTable{
	["LuanShiDeJianXiong"] = "乱世的奸雄",
}
--[[****************************************************************
	战功：乱世歌姬
	描述：使用蔡文姬在一局中发动悲歌至少4次、发动断肠并最终获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["LuanShiGeJi"] = "乱世歌姬",
}
--[[****************************************************************
	战功：乱世名医
	描述：使用华佗在1局游戏中发动急救使至少3个不同的角色脱离濒死状态
]]--****************************************************************
sgs.LoadTranslationTable{
	["LuanShiMingYi"] = "乱世名医",
}
--[[****************************************************************
	战功：洛神赋
	描述：使用甄姬一回合内发动洛神在不被改变判定牌的情况下连续判定黑色花色至少8次
]]--****************************************************************
sgs.LoadTranslationTable{
	["LuoShenFu"] = "洛神赋",
}
--[[****************************************************************
	战功：妈，我冷
	描述：使用许褚在1局游戏中发动裸衣至少2次并在裸衣的回合中杀死过至少2名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["Ma_WoLeng"] = "妈，我冷",
}
--[[****************************************************************
	战功：猛锐盖世
	描述：使用孙策在一局游戏中发动激昂摸牌至少5张并发动技能魂姿
]]--****************************************************************
sgs.LoadTranslationTable{
	["MengRuiGaiShi"] = "猛锐盖世",
}
--[[****************************************************************
	战功：妙法仁心
	描述：使用曹冲在一局游戏中对魏势力角色发动仁心至少3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["MiaoFaRenXin"] = "妙法仁心",
}
--[[****************************************************************
	战功：能进能退
	描述：使用☆SP赵云在一局游戏中至少发动冲阵获得6张牌并获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["NengJinNengTui"] = "能进能退",
}
--[[****************************************************************
	战功：你死我活
	描述：使用夏侯惇在1局游戏中发动刚烈杀死至少1名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["NiSiWoHuo"] = "你死我活",
}
--[[****************************************************************
	战功：逆天改命
	描述：使用张宝在一局游戏中发动咒缚4次，影兵2次
]]--****************************************************************
sgs.LoadTranslationTable{
	["NiTianGaiMing"] = "逆天改命",
}
--[[****************************************************************
	战功：破虏大将军
	描述：使用孙坚连续至少3回合在1体力时发动英魂
]]--****************************************************************
sgs.LoadTranslationTable{
	["PoLuDaJiangJun"] = "破虏大将军",
}
--[[****************************************************************
	战功：破阵斩将
	描述：使用高顺在一局游戏中发动陷阵拼点赢的情况下杀死至少两名角色并获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["PoZhenZhanJiang"] = "破阵斩将",
}
--[[****************************************************************
	战功：破竹之咒
	描述：使用陈琳在一局游戏中对曹操使用笔伐，并使用颂词使其摸两张牌
]]--****************************************************************
sgs.LoadTranslationTable{
	["PoZhuZhiZhou"] = "破竹之咒",
}
--[[****************************************************************
	战功：七步成诗
	描述：使用曹植在一局游戏中发动酒诗7次
]]--****************************************************************
sgs.LoadTranslationTable{
	["QiBuChengShi"] = "七步成诗",
}
--[[****************************************************************
	战功：奇计百出
	描述：使用荀攸在一局游戏中，发动“奇策”使用至少六种锦囊
]]--****************************************************************
sgs.LoadTranslationTable{
	["QiJiBaiChu"] = "奇计百出",
}
--[[****************************************************************
	战功：奇谋九计
	描述：使用旧王异在一局游戏中至少成功发动九次秘计并获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["QiMouJiuJi"] = "奇谋九计",
}
--[[****************************************************************
	战功：其利断金
	描述：使用颜良文丑在1局游戏中发动双雄至少3次并在双雄的回合中杀死过至少3名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["QiLiDuanJin"] = "其利断金",
}
--[[****************************************************************
	战功：七擒七纵
	描述：使用孟获在1局游戏中发动再起回复体力至少7点
]]--****************************************************************
sgs.LoadTranslationTable{
	["QiQinQiZong"] = "七擒七纵",
}
--[[****************************************************************
	战功：枪林弹雨
	描述：使用袁绍在一回合内发动8次乱击
]]--****************************************************************
sgs.LoadTranslationTable{
	["QiangLinDanYu"] = "枪林弹雨",
}
--[[****************************************************************
	战功：倾国倾城
	描述：使用貂蝉在1局游戏中发动离间造成至少3名角色死亡
]]--****************************************************************
sgs.LoadTranslationTable{
	["QingGuoQingCheng"] = "倾国倾城",
}
--[[****************************************************************
	战功：驱虎吞狼
	描述：使用荀彧在1局游戏中至少发动5次驱虎并拼点成功
]]--****************************************************************
sgs.LoadTranslationTable{
	["QuHuTunLang"] = "驱虎吞狼",
}
--[[****************************************************************
	战功：全军突击
	描述：使用马超在1局游戏中发动铁骑连续判定红色花色至少5次
]]--****************************************************************
sgs.LoadTranslationTable{
	["QuanJunTuJi"] = "全军突击",
}
--[[****************************************************************
	战功：权倾天下
	描述：使用钟会在一局游戏中发动“排异”累计摸牌至少10张
]]--****************************************************************
sgs.LoadTranslationTable{
	["QuanQingTianXia"] = "权倾天下",
}
--[[****************************************************************
	战功：仁心布众
	描述：使用刘备或旧刘备在一局游戏中，累计仁德至少30张牌
]]--****************************************************************
sgs.LoadTranslationTable{
	["RenXinBuZhong"] = "仁心布众",
}
--[[****************************************************************
	战功：肉山
	描述：使用董卓在1局游戏中使用杀杀死至少3名女性角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["RouShan"] = "肉山",
}
--[[****************************************************************
	战功：三分归晋
	描述：使用神司马懿杀死刘备，孙权，曹操各累计10次
]]--****************************************************************
sgs.LoadTranslationTable{
	["SanFenGuiJin"] = "三分归晋",
}
--[[****************************************************************
	战功：三思而行
	描述：使用孙权在一局游戏中利用制衡获得至少4张无中生有以及4张桃
]]--****************************************************************
sgs.LoadTranslationTable{
	["SanSiErXing"] = "三思而行",
}
--[[****************************************************************
	战功：上将杀手
	描述：使用潘璋＆马忠在一局游戏中杀死关羽和黄忠并获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShangJiangShaShou"] = "上将杀手",
}
--[[****************************************************************
	战功：舌灿莲花
	描述：使用简雍在一局游戏中，发动巧说拼点赢后，为桃、顺手牵羊和决斗各额外选择一名目标
]]--****************************************************************
sgs.LoadTranslationTable{
	["SheCanLianHua"] = "舌灿莲花",
}
--[[****************************************************************
	战功：身曹心汉
	描述：使用新徐庶在一局游戏中对蜀势力角色发动举荐至少3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShenCaoXinHan"] = "身曹心汉",
}
--[[****************************************************************
	战功：身体要紧
	描述：在主公是刘备的情况下，使用SP孙尚香做内奸取得胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShenTiYaoJin"] = "身体要紧",
}
--[[****************************************************************
	战功：深思熟虑
	描述：使用孙权在一个回合内发动制衡的牌不少于10张
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShenSiShuLv"] = "深思熟虑",
}
--[[****************************************************************
	战功：神出鬼没
	描述：使用甘宁在1个回合内发动至少6次奇袭
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShenChuGuiMo"] = "神出鬼没",
}
--[[****************************************************************
	战功：神鬼莫测
	描述：使用于吉在1局游戏中累计蛊惑假牌至少成功3次
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShenGuiMoCe"] = "神鬼莫测",
}
--[[****************************************************************
	战功：神鬼无双
	描述：使用神吕布在一局游戏中发动神愤至少2次
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShenGuiWuShuang"] = "神鬼无双",
}
--[[****************************************************************
	战功：神威之势
	描述：使用神赵云发动各花色龙魂各两次并在存活的情况下取得游戏胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShenWeiZhiShi"] = "神威之势",
}
--[[****************************************************************
	战功：神仙难救
	描述：使用贾诩在你的回合中有至少3个角色阵亡
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShenXianNanJiu"] = "神仙难救",
}
--[[****************************************************************
	战功：生不逢时
	描述：使用双雄对关羽使用决斗，并因这个决斗被关羽杀死
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShengBuFengShi"] = "生不逢时",
}
--[[****************************************************************
	战功：十倍奉还
	描述：使用法正在一局游戏中发动眩惑获得其他角色至少3张桃
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShiBeiFengHuan"] = "十倍奉还",
}
--[[****************************************************************
	战功：石城侯使
	描述：用韩当在一局游戏中发动技能弓骑弃置他人共计3张牌
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShiChengHouShi"] = "石城侯使",
}
--[[****************************************************************
	战功：失礼了
	描述：使用☆SP貂蝉在一局游戏中至少发动3次离魂并获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShiLiLe"] = "失礼了",
}
--[[****************************************************************
	战功：嗜血成性
	描述：使用魏延在1回合内发动狂骨回复至少3点体力
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShiXieChengXing"] = "嗜血成性",
}
--[[****************************************************************
	战功：恃勇轻敌
	描述：使用华雄在一局游戏中，在没有马岱在场的情况下由于体力上限减至0而死亡
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShiYongQingDi"] = "恃勇轻敌",
}
--[[****************************************************************
	战功：手眼通天
	描述：使用司马懿在1局游戏中有至少2次发动反馈都抽到对方1张桃
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShouYanTongTian"] = "手眼通天",
}
--[[****************************************************************
	战功：蜀之终结者
	描述：使用邓艾在一回合内发动急袭至少4次
]]--****************************************************************
sgs.LoadTranslationTable{
	["ShuZhiZhongJieZhe"] = "蜀之终结者",
}
--[[****************************************************************
	战功：四海归心
	描述：使用神曹操在一局游戏中受到2点伤害之后发动2次归心
]]--****************************************************************
sgs.LoadTranslationTable{
	["SiHaiGuiXin"] = "四海归心",
}
--[[****************************************************************
	战功：四世三公
	描述：使用袁术在1回合内消灭场上4个势力中的3个
]]--****************************************************************
sgs.LoadTranslationTable{
	["SiShiSanGong"] = "四世三公",
}
--[[****************************************************************
	战功：伺机待发
	描述：使用吕蒙将手牌囤积到20张
]]--****************************************************************
sgs.LoadTranslationTable{
	["SiJiDaiFa"] = "伺机待发",
}
--[[****************************************************************
	战功：岁月静好
	描述：使用☆SP大乔在一局游戏中发动安娴五次并获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["SuiYueJingHao"] = "岁月静好",
}
--[[****************************************************************
	战功：桃园之梦
	描述：使用神关羽在一局游戏中阵亡后发动武魂判定结果为桃园结义
]]--****************************************************************
sgs.LoadTranslationTable{
	["TaoYuanZhiMeng"] = "桃园之梦",
}
--[[****************************************************************
	战功：桃园之义
	描述：在一局游戏中，场上同时存在刘备、关羽、张飞三人且为队友，而你是其中一个并最后获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["TaoYuanZhiYi"] = "桃园之义",
}
--[[****************************************************************
	战功：天火燎原
	描述：使用卧龙诸葛亮在1回合内发动火计造成至少6点伤害
]]--****************************************************************
sgs.LoadTranslationTable{
	["TianHuoLiaoYuan"] = "天火燎原",
}
--[[****************************************************************
	战功：天命难违
	描述：使用司马懿被自己挂的闪电劈死，不包括改判
]]--****************************************************************
sgs.LoadTranslationTable{
	["TianMingNanWei"] = "天命难违",
}
--[[****************************************************************
	战功：天命之罚
	描述：在一局游戏中，使用司马懿更改闪电判定牌至少劈中其他角色两次
]]--****************************************************************
sgs.LoadTranslationTable{
	["TianMingZhiFa"] = "天命之罚",
}
--[[****************************************************************
	战功：天下归心
	描述：使用神曹操在一局游戏中发动归心获得至少10张牌
]]--****************************************************************
sgs.LoadTranslationTable{
	["TianXiaGuiXin"] = "天下归心",
}
--[[****************************************************************
	战功：铁锁连舟
	描述：使用庞统在1回合内发动连环横置至少6名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["TieSuoLianZhou"] = "铁索连舟",
}
--[[****************************************************************
	战功：通晓兵法
	描述：使用马谡在一局游戏中发动心战获得桃和无中生有至少各2张
]]--****************************************************************
sgs.LoadTranslationTable{
	["TongXiaoBingFa"] = "通晓兵法",
}
--[[****************************************************************
	战功：微妙玄通
	描述：使用虞翻在一局游戏中发动直言令其他角色摸到装备牌至少3张
]]--****************************************************************
sgs.LoadTranslationTable{
	["WeiMiaoXuanTong"] = "微妙玄通",
}
--[[****************************************************************
	战功：魏文帝
	描述：使用曹丕在1局游戏中发动行殇获得锦囊牌至少6张
]]--****************************************************************
sgs.LoadTranslationTable{
	["WeiWenDi"] = "魏文帝",
}
--[[****************************************************************
	战功：惟贤惟德
	描述：使用刘备或旧刘备在一个回合内发动仁德给的牌不少于10张
]]--****************************************************************
sgs.LoadTranslationTable{
	["WeiXianWeiDe"] = "惟贤惟德",
}
--[[****************************************************************
	战功：文姬归汉
	描述：在主公是曹操的情况下，使用SP蔡文姬做内奸取得胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["WenJiGuiHan"] = "文姬归汉",
}
--[[****************************************************************
	战功：稳重行军
	描述：使用于禁在一局游戏中发动“毅重”抵御至少4次黑色杀
]]--****************************************************************
sgs.LoadTranslationTable{
	["WenZhongXingJun"] = "稳重行军",
}
--[[****************************************************************
	战功：我看好你
	描述：使用徐庶在一局游戏中发动举荐至少6次
]]--****************************************************************
sgs.LoadTranslationTable{
	["WoKanHaoNi"] = "我看好你",
}
--[[****************************************************************
	战功：吴国之母
	描述：使用吴国太在一局游戏中发动补益使至少3名不同的吴国武将脱离频死状态
]]--****************************************************************
sgs.LoadTranslationTable{
	["WuGuoZhiMu"] = "吴国之母",
}
--[[****************************************************************
	战功：武姬
	描述：使用关银屏在一局游戏中发动技能虎啸3次，血祭1次
]]--****************************************************************
sgs.LoadTranslationTable{
	["WuJi"] = "武姬",
}
--[[****************************************************************
	战功：无尽的鞭挞
	描述：使用黄盖1个回合内发动至少8次苦肉
]]--****************************************************************
sgs.LoadTranslationTable{
	["WuJinDeBianTa"] = "无尽的鞭挞",
}
--[[****************************************************************
	战功：无尽的挣扎
	描述：使用周瑜在1局游戏中使用反间杀死至少3名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["WuJinDeZhengZha"] = "无尽的挣扎",
}
--[[****************************************************************
	战功：无谋竖子
	描述：使用神吕布在一局游戏中发动无谋至少8次
]]--****************************************************************
sgs.LoadTranslationTable{
	["WuMouShuZi"] = "无谋竖子",
}
--[[****************************************************************
	战功：无言以对
	描述：使用徐庶在一局游戏中发动“无言”躲过南蛮入侵或万箭齐发累计4次
]]--****************************************************************
sgs.LoadTranslationTable{
	["WuYanYiDui"] = "无言以对",
}
--[[****************************************************************
	战功：武圣显灵
	描述：使用关羽在1局游戏中发动武圣至少杀死3名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["WuShengXianLing"] = "武圣显灵",
}
--[[****************************************************************
	战功：西凉铁骑
	描述：使用SP马超在一局游戏中至少发动5次铁骑并判定为红色
]]--****************************************************************
sgs.LoadTranslationTable{
	["XiLiangTieJi"] = "西凉铁骑",
}
--[[****************************************************************
	战功：先知续命
	描述：使用郭嘉在一局游戏中利用技能“天妒”收进至少4个桃
]]--****************************************************************
sgs.LoadTranslationTable{
	["XianZhiXuMing"] = "先知续命",
}
--[[****************************************************************
	战功：先主假子
	描述：使用刘封在一局游戏中发动陷嗣使得“逆”的数量达到8张并获得胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["XianZhuJiaZi"] = "先主假子",
}
--[[****************************************************************
	战功：险中求胜
	描述：使用夏侯霸在自己只剩下1体力的情况下获得游戏胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["XianZhongQiuSheng"] = "险中求胜",
}
--[[****************************************************************
	战功：小旋风
	描述：使用凌统在一局游戏中发动技能“旋风”弃掉其他角色累计15张牌
]]--****************************************************************
sgs.LoadTranslationTable{
	["XiaoXuanFeng"] = "小旋风",
}
--[[****************************************************************
	战功：心如寒冰
	描述：使用张春华在一局游戏中至少触发“绝情”10次以上
]]--****************************************************************
sgs.LoadTranslationTable{
	["XinRuHanBing"] = "心如寒冰",
}
--[[****************************************************************
	战功：兴家赤族
	描述：使用诸葛恪在一局游戏中发动技能黩武令两名角色进入濒死状态
]]--****************************************************************
sgs.LoadTranslationTable{
	["XingJiaChiZu"] = "兴家赤族",
}
--[[****************************************************************
	战功：星落五丈原
	描述：使用诸葛亮，在司马懿为敌方时阵亡
]]--****************************************************************
sgs.LoadTranslationTable{
	["XingLuoWuZhangYuan"] = "星落五丈原",
}
--[[****************************************************************
	战功：须臾之间
	描述：使用凌统在一局游戏中发动旋风至少弃置敌方角色装备区的牌至少8张
]]--****************************************************************
sgs.LoadTranslationTable{
	["XuYuZhiJian"] = "须臾之间",
}
--[[****************************************************************
	战功：雪恨敌耻
	描述：使用☆SP夏侯惇在一局游戏中，发动雪恨杀死一名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["XueHenDiChi"] = "雪恨敌耻",
}
--[[****************************************************************
	战功：掩其无备
	描述：使用张辽在1局游戏中发动至少10次突袭
]]--****************************************************************
sgs.LoadTranslationTable{
	["YanQiWuBei"] = "掩其无备",
}
--[[****************************************************************
	战功：燕人的咆哮
	描述：使用张飞在1局游戏中发动丈八蛇矛特效杀死至少1名角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["YanRenDePaoXiao"] = "燕人的咆哮",
}
--[[****************************************************************
	战功：严整溃围
	描述：使用☆SP曹仁在一局游戏中发动溃围摸牌至少11张并发动严整至少4次
]]--****************************************************************
sgs.LoadTranslationTable{
	["YanZhengKuiWei"] = "严整溃围",
}
--[[****************************************************************
	战功：义薄云天
	描述：使用SP关羽在觉醒后杀死两个反贼并最后获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["YiBoYunTian"] = "义薄云天",
}
--[[****************************************************************
	战功：一夫当关
	描述：使用典韦在1局游戏中发动至少5次强袭
]]--****************************************************************
sgs.LoadTranslationTable{
	["YiFuDangGuan"] = "一夫当关",
}
--[[****************************************************************
	战功：移花接木
	描述：使用大乔在一局游戏中累计发动5次流离
]]--****************************************************************
sgs.LoadTranslationTable{
	["YiHuaJieMu"] = "移花接木",
}
--[[****************************************************************
	战功：一骑当先
	描述：使用乐进在一局游戏中发动骁果杀死至少2名角色并获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["YiJiDangXian"] = "一骑当先",
}
--[[****************************************************************
	战功：以死安大局
	描述：使用马谡在一局游戏中发动“挥泪”使一名角色弃置8张牌
]]--****************************************************************
sgs.LoadTranslationTable{
	["YiSiAnDaJu"] = "以死安大局",
}
--[[****************************************************************
	战功：医者仁心
	描述：使用华佗在一局游戏中对4个身份的人都发动过青囊并最后获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["YiZheRenXin"] = "医者仁心",
}
--[[****************************************************************
	战功：因祸得福
	描述：使用孙尚香在1局游戏中累计失去至少5张已装备的装备牌
]]--****************************************************************
sgs.LoadTranslationTable{
	["YinHuoDeFu"] = "因祸得福",
}
--[[****************************************************************
	战功：隐忍不发
	描述：使用神司马懿在一局游戏中发动忍戒至少10次并获胜
]]--****************************************************************
sgs.LoadTranslationTable{
	["YinRenBuFa"] = "隐忍不发",
}
--[[****************************************************************
	战功：有难你当
	描述：使用小乔在一局游戏中发动“天香”导致一名其他角色死亡
]]--****************************************************************
sgs.LoadTranslationTable{
	["YouNanNiDang"] = "有难你当",
}
--[[****************************************************************
	战功：有勇有谋
	描述：使用伏完在一局游戏中发动谋溃弃掉3张闪
]]--****************************************************************
sgs.LoadTranslationTable{
	["YouYongYouMou"] = "有勇有谋",
}
--[[****************************************************************
	战功：与世不侵
	描述：使用伏皇后在一局游戏中发动惴恐拼点赢至少4次
]]--****************************************************************
sgs.LoadTranslationTable{
	["YuShiBuQin"] = "与世不侵",
}
--[[****************************************************************
	战功：战神之怒
	描述：使用神吕布在一局游戏中发动至少4次神愤、3次无前
]]--****************************************************************
sgs.LoadTranslationTable{
	["ZhanShenZhiNu"] = "战神之怒",
}
--[[****************************************************************
	战功：昭烈之怒
	描述：在一局游戏中，使用☆SP刘备发动昭烈杀死至少2人
]]--****************************************************************
sgs.LoadTranslationTable{
	["ZhaoLieZhiNu"] = "昭烈之怒",
}
--[[****************************************************************
	战功：真命天子
	描述：使用刘协在一局游戏中发动密诏4次，天命4次，并最终胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["ZhenMingTianZi"] = "真命天子",
}
--[[****************************************************************
	战功：指囷相赠
	描述：使用鲁肃在1局游戏中发动好施分给其他角色至少15张牌
]]--****************************************************************
sgs.LoadTranslationTable{
	["ZhiQunXiangZeng"] = "指囷相赠",
}
--[[****************************************************************
	战功：智之化身
	描述：使用黄月英在一局游戏发动至少20次集智
]]--****************************************************************
sgs.LoadTranslationTable{
	["ZhiZhiHuaShen"] = "智之化身",
}
--[[****************************************************************
	战功：周苛之节
	描述：使用庞德在1局游戏中发动猛进至少5次
]]--****************************************************************
sgs.LoadTranslationTable{
	["ZhouKeZhiJie"] = "周苛之节",
}
--[[****************************************************************
	战功：宗室遍四海
	描述：使用刘表在一局游戏中利用技能“宗室”提高4手牌上限
]]--****************************************************************
sgs.LoadTranslationTable{
	["ZongShiBianSiHai"] = "宗室遍四海",
}
--[[****************************************************************
	战功：走马荐诸葛
	描述：使用旧徐庶在一局游戏中至少有3次举荐诸葛且用于举荐的牌里必须有马
]]--****************************************************************
sgs.LoadTranslationTable{
	["ZouMaJianZhuGe"] = "走马荐诸葛",
}
--[[****************************************************************
	----------------------------------------------------------------
							3v3模式战功
	----------------------------------------------------------------
]]--****************************************************************
--[[****************************************************************
	战功：暴发户
	描述：一回合内获得至少10张手牌 (3v3)
]]--****************************************************************
sgs.LoadTranslationTable{
	["BaoFaHu"] = "暴发户",
}
--[[****************************************************************
	战功：背水一战
	描述：身为主帅，在本方两名前锋阵亡的情况下，杀死对方3人后获胜 (3v3)
]]--****************************************************************
sgs.LoadTranslationTable{
	["BeiShuiYiZhan"] = "背水一战",
}
--[[****************************************************************
	战功：持久战
	描述：在自己的第5回合结束后获得胜利 (3v3)
]]--****************************************************************
sgs.LoadTranslationTable{
	["ChiJiuZhan"] = "持久战",
}
--[[****************************************************************
	战功：舍生取义
	描述：身为前锋，被本方角色杀死累计10次 (3v3)
]]--****************************************************************
sgs.LoadTranslationTable{
	["SheShengQuYi"] = "舍生取义",
}
--[[****************************************************************
	战功：肆无忌惮
	描述：一回合内使用至少3张南蛮入侵或万箭齐发 (3v3)
]]--****************************************************************
sgs.LoadTranslationTable{
	["SiWuJiDan"] = "肆无忌惮",
}
--[[****************************************************************
	战功：速战速决
	描述：在自己的首回合结束前获得胜利 (3v3)
]]--****************************************************************
sgs.LoadTranslationTable{
	["SuZhanSuJue"] = "速战速决",
}
--[[****************************************************************
	战功：一鼓作气
	描述：一回合内杀死对方3名角色 (3v3)
]]--****************************************************************
sgs.LoadTranslationTable{
	["YiGuZuoQi"] = "一鼓作气",
}
--[[****************************************************************
	战功：直捣黄龙
	描述：在对方两名前锋都没有受伤的情况下杀死对方主帅 (3v3)
]]--****************************************************************
sgs.LoadTranslationTable{
	["ZhiDaoHuangLong"] = "直捣黄龙",
}
--[[****************************************************************
	----------------------------------------------------------------
							1v1模式战功
	----------------------------------------------------------------
]]--****************************************************************
--[[****************************************************************
	战功：兵不血刃
	描述：对方3名武将都在他们各自的回合阵亡 (1v1)
]]--****************************************************************
sgs.LoadTranslationTable{
	["BingBuXueRen"] = "兵不血刃",
}
--[[****************************************************************
	战功：毫发无伤
	描述：在本方所有武将满体力的情况下胜利 (1v1)
]]--****************************************************************
sgs.LoadTranslationTable{
	["HaoFaWuShang"] = "毫发无伤",
}
--[[****************************************************************
	战功：护国军师
	描述：以诸葛亮、司马懿、周瑜为上场武将的情况下获胜 (1v1)
]]--****************************************************************
sgs.LoadTranslationTable{
	["HuGuoJunShi"] = "护国军师",
}
--[[****************************************************************
	战功：巾帼英雄
	描述：选择3名女性武将并且获胜 (1v1)
]]--****************************************************************
sgs.LoadTranslationTable{
	["JinGuoYingXiong"] = "巾帼英雄",
}
--[[****************************************************************
	战功：惊天逆转
	描述：在本方剩余1名武将时，杀死对方3名武将获胜 (1v1)
]]--****************************************************************
sgs.LoadTranslationTable{
	["JingTianNiZhuan"] = "惊天逆转",
}
--[[****************************************************************
	战功：谋略过人
	描述：选择了3名3血武将并且获胜 (1v1)
]]--****************************************************************
sgs.LoadTranslationTable{
	["MouLveGuoRen"] = "谋略过人",
}
--[[****************************************************************
	战功：勇猛过人
	描述：选择了3名4血武将并且获胜 (1v1)
]]--****************************************************************
sgs.LoadTranslationTable{
	["YongMengGuoRen"] = "勇猛过人",
}
--[[****************************************************************
	战功：有勇无谋
	描述：以吕布、张飞、许褚为上场武将的情况下获胜 (1v1)
]]--****************************************************************
sgs.LoadTranslationTable{
	["YouYongWuMou"] = "有勇无谋",
}
--[[****************************************************************
	战功：智勇双全
	描述：以关羽、赵云、黄忠为上场武将的情况下获胜 (1v1)
]]--****************************************************************
sgs.LoadTranslationTable{
	["ZhiYongShuangQuan"] = "智勇双全",
}
--[[****************************************************************
	----------------------------------------------------------------
							虎牢关模式战功
	----------------------------------------------------------------
]]--****************************************************************
--[[****************************************************************
	战功：屌丝的逆袭
	描述：身为虎牢关联军的先锋，第一回合就爆了虎牢布的菊花（使吕布变身为暴怒战神）
]]--****************************************************************
sgs.LoadTranslationTable{
	["DiaoSiDeNiXi"] = "屌丝的逆袭",
}
--[[****************************************************************
	----------------------------------------------------------------
								隐藏战功
	----------------------------------------------------------------
]]--****************************************************************
--[[****************************************************************
	战功：神话
	描述：使用马谡，通过发动一次“心战”技能获得三张【桃】或三张【无中生有】
]]--****************************************************************
sgs.LoadTranslationTable{
	["vShenHua"] = "神话",
}
--[[****************************************************************
	战功：传说
	描述：使用陆逊，在装备连弩的一个回合中，连续使用了44张【杀】并杀死至少一名其他角色
]]--****************************************************************
sgs.LoadTranslationTable{
	["vChuanShuo"] = "传说",
}
--[[****************************************************************
	战功：不可能完成的任务
	描述：使用于禁，在第一个回合结束之前，还未使用任何牌就启用“托管”功能直至游戏结束，然后在队友全部阵亡的条件下存活并获得胜利
]]--****************************************************************
sgs.LoadTranslationTable{
	["vBuKeNengWanChengDeRenWu"] = "不可能完成的任务",
}
--[[****************************************************************
	战功：头等大奖
	描述：在“技能钥匙”模式下一次性获得五把技能钥匙
]]--****************************************************************
sgs.LoadTranslationTable{
	["vTouDengDaJiang"] = "头等大奖",
}
--[[****************************************************************
	战功：战功之鬼
	描述：在“珍贵的经验”模式下选择以正确的姿势投降……
]]--****************************************************************
sgs.LoadTranslationTable{
	["vSuperMan"] = "战功之鬼",
}
--[[****************************************************************
	----------------------------------------------------------------
								附加功能
	----------------------------------------------------------------
]]--****************************************************************
--[[****************************************************************
	战功：文功
	描述：每使用或打出一张锦囊牌，获得1点文功
]]--****************************************************************
sgs.LoadTranslationTable{
	["gainWenGong"] = "文功",
	["#gainWenGong"] = "<b><font color=\"cyan\">系统消息</font>：%from 获得了 %arg 点文功。</b>",
}
--[[****************************************************************
	战功：武功
	描述：每使用或打出一张杀，获得1点武功
]]--****************************************************************
sgs.LoadTranslationTable{
	["gainWuGong"] = "武功",
	["#gainWuGong"] = "<b><font color=\"cyan\">系统消息</font>：%from 获得了 %arg 点武功。</b>",
}
--[[****************************************************************
	战功：经验
	描述：每造成1点伤害，获得1点经验，每次伤害最多获得8点经验
]]--****************************************************************
sgs.LoadTranslationTable{
	["gainExperience"] = "经验",
	["#gainExperience"] = "<b><font color=\"cyan\">系统消息</font>：%from 获得了 %arg 点经验。</b>",
}
--[[****************************************************************
	战功：技能钥匙
	描述：杀死一名角色后，随机获得一定数目的技能钥匙。
	说明：游戏开始时，若已获得至少一把技能钥匙，系统将随机选取至多5个场上不存在的技能；
		可以失去1点体力并使用一把技能钥匙，选择并获得其中的一个技能。
]]--****************************************************************
sgs.LoadTranslationTable{
	["gainExtraSkill"] = "技能钥匙",
	["#gainExtraSkill"] = "<b><font color=\"cyan\">系统消息</font>：%from 找到了 %arg 把技能钥匙！（目前已获得 %arg2 把）</b>",
	["gainExtraSkill:cancel"] = "不使用“技能钥匙”",
}
--[[****************************************************************
	战功：珍贵的经验
	描述：一名己方角色阵亡后，若场上人数不少于3且自己为己方仅存角色，可以消耗一定的经验执行一个效果
]]--****************************************************************
sgs.LoadTranslationTable{
	["glory:itemA"] = "[EXP50] 令所有其他未翻面的角色翻面",
	["glory:itemB"] = "[EXP125] 重置武将并摸三张牌",
	["glory:itemC"] = "[EXP300] 随机挂满装备并将手牌补至体力上限",
	["glory:itemD"] = "[EXP500] 令一名角色失去一项技能",
	["glory:itemE"] = "[EXP985] 令所有其他角色依次失去1点体力上限",
	["glory:itemF"] = "[EXP2350] 进入濒死时自动脱离并补满体力（限X次，X为当前场上角色数）",
	["glory:itemG"] = "[EXP5050] 复活一名已阵亡的角色",
	["glory:itemH"] = "[EXP12580] 将一名其他角色的身份变为与自己一致并重置其AI",
	["glory:itemI"] = "[EXP32767] 最后的手段……",
	["glory:cancel"] = "算了，我能挺住。",
	["#gloryPECancel"] = "<b><font color=\"lightpink\">来自系统的赞叹</font>：%from 你真是条汉子！自求多福吧……</b>",
	["#gloryItemF_Effect"] = "<b><font color=\"red\">系统消息</font>：%from 的特权被触发，自动脱离了濒死</b>",
	["@glory-detachSkill"] = "珍贵的经验：请选择一名角色以解除其技能",
	["@glory-resetRole"] = "珍贵的经验：请选择一名角色以改变其身份",
}
--[[
	效果：进入濒死时自动脱离并补满体力
]]--
gloryItemF = sgs.CreateTriggerSkill{
	name = "#gloryItemF",
	global = true,
	frequency = sgs.Skill_Compulsory,
	events = {sgs.EnterDying},
	on_trigger = function(self, event, player, data)
		local dying = data:toDying()
		local victim = dying.who
		if victim and victim:objectName() == player:objectName() then
			local room = player:getRoom()
			room:removePlayerMark(player, "glory_itemF", 1)
			local msg = sgs.LogMessage()
			msg.type = "#gloryItemF_Effect"
			msg.from = player
			room:sendLog(msg) --发送提示信息
			local recover = sgs.RecoverStruct()
			recover.who = player
			recover.recover = victim:getMaxHp() - victim:getHp()
			room:recover(victim, recover)
			return true
		end
		return false
	end,
	can_trigger = function(self, target)
		return target and target:isAlive() and target:getMark("glory_itemF") > 0 
	end,
	priority = 9,
}
AnJiang:addSkill(gloryItemF)